Repository: 84000/data-translation-memory
Catalog: toh79-v3.tmx
Source language: bo
Languages: en

source: སེང་གེའི་ཁྲི་རྣམས་ཀྱང་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་འཁོར་གྱི་ཁྱམས་བཀོད་པ་དང་། སེང་གེའི་ཁྲི་བཀོད་པ་བགྱིས་ལགས་ན་ད་དེའི་དུས་ལ་བབ་པར་མཁྱེན་ན་གཤེགས་སུ་གསོལ། དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཉིས་སྟོང་དང་།
en: Having arranged the assembly space in this fashion and prepared the lion thrones, the god Śrībhadra joined his palms and said to Mañjuśrī Kumārabhūta, “Mañjuśrī, the assembly space and the lion thrones are ready.

source: ཉན་ཐོས་ཀྱི་མཆོག་ལྔ་བརྒྱ་དང་།
en: If you deem the time opportune, please approach.”

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་སྟོང་ཕྲག་དུ་མ་དག་དང་ལྷན་ཅིག་ཏུ་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: At that moment, Mañjuśrī Kumārabhūta, accompanied by twelve thousand bodhisattvas and five hundred excellent śrāvakas, and surrounded and escorted by thousands of gods, nāgas, yakṣas, and gandharvas, bowed his head to the Bhagavān’s feet, circumambulated the Bhagavān three times, then disappeared from the Bhagavān’s presence and arrived at that very instant in the Heaven of Joy.

source: བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་ནས་མི་སྣང་བར་གྱུར་ནས། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་དགའ་ལྡན་གྱི་གནས་སུ་ཕྱིན་ཏོ། །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་རིན་པོ་ཆེ་བཀོད་པའི་འཁོར་གྱི་ཁྱམས་དེར་རང་གི་ཁྲི་ཇི་ལྟར་བཤམས་པ་ལ་འདུག་གོ །
en: Mañjuśrī Kumārabhūta then took his seat upon the throne that had been set out for him in the midst of that assembly space made from precious jewels.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་ཀྱང་སྟན་ཅི་རིགས་པ་ལ་འཁོད་དོ། །
en: The bodhisattvas and the great śrāvakas, and all the members of the accompanying retinue, also took their appropriate seats.

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། འཐབ་བྲལ་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། བདུད་ཀྱི་རིས་རྣམས་དང་། གཟུགས་ན་སྤྱོད་པའི་ཚངས་རིས་ཀྱི་ལྷ་ནས་བཟུང་སྟེ།
en: The gods from the Heaven of the Four Great Kings, the Heaven of the Thirty-Three, the ﻿Heaven Free from Strife, ﻿the Heaven of Delighting in Emanations, ﻿the Heaven of Making Use of Others’ Emanations, and the Abode of Māras, and the gods of the form realm from the Brahmā Heavens up to the Highest Heaven, heard this news from one another.

source: འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་ཀྱིས་གཅིག་ནས་གཅིག་ཏུ་སྒྲ་ཐོས་པ།
en: The news spread: “Lo, Mañjuśrī Kumārabhūta will give a great and eloquent discourse in the Heaven of Joy.

source: འདི་ལྟར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དགའ་ལྡན་གྱི་གནས་སུ་འབེལ་བའི་ཆོས་ཀྱི་གཏམ་ཆེན་པོ་སྨྲ་བར་འགྱུར་གྱིས་བདག་ཅག་ཀྱང་ཆོས་མཉན་པའི་ཕྱིར་ངེས་པར་དེར་འདོང་བར་བྱའོ། །
en: We should definitely go there ourselves to hear it!

source: སྐྱེས་བུ་དམ་པ་དེ་ལྟ་བུ་དག་མཐོང་བ་ནི་ལེགས་པར་མཐོང་བའོ། །
en: To see holy beings such as these is a great opportunity.

source: དེ་དག་ལས་ཆོས་ཐོས་པ་ནི་ལེགས་པར་ཐོས་པའོ་ཞེས་སྒྲ་ཐོས་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་འདོད་པ་ན་སྤྱོད་པ་དང་།
en: To hear the Dharma from them is a great opportunity.”

source: གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་ཚད་མེད་གྲངས་མེད་པ་དག་རང་རང་གི་གནས་ནས་མི་སྣང་བར་གྱུར་ཏེ། དགའ་ལྡན་གྱི་གནས་སུ་ཕྱིན་ཏོ། །
en: Upon hearing this, innumerable, countless gods of the desire and form realms disappeared from their abodes and arrived instantly in the Heaven of Joy.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་དེ་ལྟ་བུའི་བྱིན་གྱི་རླབས་ཀྱི་བྱིན་གྱིས་བརླབས་པས་དེས་ལྷའི་འཁོར་དེ་ཙམ་དུ་ཚད་མེད་པ་དག་རིན་པོ་ཆེ་བཀོད་པའི་ཁྱམས་ཀྱི་འཁོར་དེ་ཉིད་དུ་གོ་སྐབས་ཡངས་པར་གནས་པར་གྱུར་ཏོ། །
en: And even though the gods were innumerable, through the blessings of Mañjuśrī Kumārabhūta, each had ample room to sit in that assembly space made from precious jewels.

source: དེ་ནས་ལྷའི་བུ་དཔལ་བཟངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་ལྷའི་འཁོར་ཆེན་པོ་འདི་འདུས་ལགས་ན་ཆོས་ཀྱི་བཀའ་མཆིད་ལས་བརྩམས་ཏེ་སྤོབས་པར་མཛད་དུ་གསོལ།
en: Then the god Śrībhadra said to Mañjuśrī Kumārabhūta, “Mañjuśrī, this great assembly of gods has gathered.

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: So, I beseech you, inspire us with a sermon on the Dharma.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ལྷའི་བུ་དཔལ་བཟངས་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་ཆོས་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྡུད་པར་འགྱུར་བ་དག་གོ །
en: Mañjuśrī Kumārabhūta then addressed the god Śrībhadra and the entire assembly: “Friends, all the virtuous qualities of bodhisattvas can be condensed into four qualities.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: འདི་ལྟ་སྟེ་ཚུལ་ཁྲིམས་ལ་གནས་པའི་ཐོས་པ་དང་། བསམ་གཏན་ལ་གནས་པའི་ཤེས་རབ་དང་། མངོན་པར་ཤེས་པ་ལ་གནས་པའི་ཡེ་ཤེས་དང་། ཐབས་ལ་གནས་པའི་བག་ཡོད་པ་སྟེ།
en: They are learning grounded in moral discipline, wisdom grounded in meditative concentration, gnosis grounded in higher perceptions, and heedfulness grounded in skillful means.

source: གྲོགས་པོ་དག་ཆོས་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྡུད་པར་འགྱུར་བའོ། །
en: Friends, these four qualities encompass all the virtuous qualities of bodhisattvas.

source: གྲོགས་པོ་དག་དེ་ལ་ཡོངས་སུ་དག་པ་རྣམ་པ་བརྒྱད་ཀྱིས་ཚུལ་ཁྲིམས་ལ་འཇུག་སྟེ། ཡོངས་སུ་དག་པ་རྣམ་པ་བརྒྱད་ཀྱིས་ཇི་ལྟར་འཇུག་ཅེ་ན། འདི་ལྟ་སྟེ།
en: “Friends, one engages in moral discipline through eight modes of purification.

source: ལུས་དག་པའི་རྣམ་པས་འཇུག་པ་དང་།
en: How does one engage these eight modes of purification?

source: ངག་དག་པའི་རྣམ་པས་འཇུག་པ་དང་། སེམས་དག་པའི་རྣམ་པས་འཇུག་པ་དང་། བསམ་པ་དག་པའི་རྣམ་པས་འཇུག་པ་དང་། འཚོ་བ་དག་པའི་རྣམ་པས་འཇུག་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པ་དག་པའི་རྣམ་པས་འཇུག་པ་དང་། ཚུལ་འཆོས་པ་དང་།
en: Like this: one engages in moral discipline with (1) pure body, (2) pure speech, (3) pure mind, (4) pure thoughts, and (5) pure livelihood; (6) pure spiritual practice and strict abstinence; (7) abandoning all forms of hypocrisy, flattery, hustling, and hankering after others’ property; and (8) not forgetting the mind set on awakening.

source: ཁ་གསག་དང་། གཞོགས་སློང་དང་། ཐོབ་ཀྱིས་འཇལ་བ་ཐམས་ཅད་རྣམ་པར་སྤོང་བའི་རྣམ་པས་འཇུག་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་རྣམ་པས་འཇུག་པ་སྟེ། གྲོགས་པོ་དག་དེ་ལྟར་ཡོངས་སུ་དག་པ་རྣམ་པ་བརྒྱད་ཀྱིས་ཚུལ་ཁྲིམས་ལ་འཇུག་གོ །
en: Friends, through these eight modes of purification, one engages in moral discipline.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་ཐོས་པ་ཡོངས་སུ་དག་སྟེ།
en: “Friends, one purifies learning through eight modes.

source: རྣམ་པ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these eight?

source: བླ་མ་ལ་གུས་པས་ཡོངས་སུ་དག་པ་དང་། ང་རྒྱལ་བཅོམ་པས་ཡོངས་སུ་དག་པ་དང་། བརྩོན་འགྲུས་དང་ཏིང་ངེ་འཛིན་ཐོབ་པས་ཡོངས་སུ་དག་པ་དང་། དྲན་པ་མི་གཡེང་བས་ཡོངས་སུ་དག་པ་དང་། བསྟན་པ་དང་རབ་ཏུ་བཤད་པས་ཡོངས་སུ་དག་པ་དང་། བདག་ལ་མི་སྟོད་ཅིང་གཞན་ལ་མི་སྨོད་པས་ཡོངས་སུ་དག་པ་དང་།
en: They are these: one purifies learning by (1) respecting the guru, (2) destroying pride, (3) perfecting perseverance and meditative concentration, (4) not letting mindfulness waver, (5) teaching and explaining the Dharma, (6) not praising oneself or disparaging others, (7) appropriate analysis, and (8) behaving with qualities as instructed.

source: ཚུལ་བཞིན་དུ་སོ་སོར་རྟོག་པས་ཡོངས་སུ་དག་པ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་སྒྲུབ་པས་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་དེ་ལྟར་རྣམ་པ་བརྒྱད་ཀྱིས་ཐོས་པ་ཡོངས་སུ་དག་གོ །
en: Friends, through these eight modes, one purifies learning.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་བསམ་གཏན་ཡོངས་སུ་དག་པ་སྟེ།
en: “Friends, one purifies meditative concentration through eight modes.

source: དགོན་པ་ལ་གནས་ཤིང་དབེན་པ་ལ་དགའ་བས་ཡོངས་སུ་དག་པ་དང་། འདུ་འཛི་སྤོང་བས་ཡོངས་སུ་དག་པ་དང་། ཡུལ་དང་མི་འདྲེ་བས་ཡོངས་སུ་དག་པ་དང་། ལུས་དང་སེམས་ལས་སུ་རུང་བས་ཡོངས་སུ་དག་པ་དང་། ཁ་ཟས་བསྙུངས་ཏེ་ལུས་འཚོ་བས་ཡོངས་སུ་དག་པ་དང་། དམིགས་པ་ལ་འཇོག་པས་ཡོངས་སུ་དག་པ་དང་། སྒྲ་དང་མཚན་མ་ཐམས་ཅད་རྣམ་པར་འཇིག་པས་ཡོངས་སུ་དག་པ་དང་།
en: They are these: one purifies concentration by (1) staying in remote places and delighting in isolation, (2) giving up worldly concerns, (3) not getting distracted by sense objects, (4) being pliant in body and mind, (5) subsisting on limited food, (6) placing one’s mind on an object, (7) eliminating the use of words and signs, and (8) completely comprehending each of the noble truths dispassionately.

source: འཕགས་པའི་བདེན་པ་དང་ཟང་ཟིང་མེད་པར་སོ་སོར་ཡང་དག་པར་བགེང་པས་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་དེ་ལྟར་རྣམ་པ་བརྒྱད་ཀྱིས་བསམ་གཏན་ཡོངས་སུ་དག་གོ །
en: Friends, through these eight modes, one purifies meditative concentration.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་ཤེས་རབ་ཡོངས་སུ་དག་སྟེ།
en: “Friends, one purifies wisdom through eight modes.

source: རྣམ་པ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕུང་པོ་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་། ཁམས་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་། སྐྱེ་མཆེད་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་།
en: What are these eight?

source: རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་། བདེན་པ་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་། དབང་པོ་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་དང་། བག་ལ་ཉལ་དང་།
en: They are these: one purifies wisdom through being learned about (1) the aggregates, (2) the constituents, (3) the sense fields, (4) dependent origination, (5) the truths, (6) the sense faculties, (7) the three doors of liberation, and (8) how to destroy predispositions, fetters, and all views.

source: ཀུན་ནས་དཀྲིས་པ་དང་། ལྟ་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པ་ལ་མཁས་པའི་རྣམ་པས་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་དེ་ལྟར་རྣམ་པ་བརྒྱད་ཀྱིས་ཤེས་རབ་ཡོངས་སུ་དག་གོ །
en: Friends, through these eight modes, one purifies wisdom.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་སྟེ།
en: “Friends, one purifies the higher perceptions through eight modes.

source: སྒྲིབ་པ་མེད་པར་གཟུགས་ཐམས་ཅད་མཐོང་བས་ལྷའི་མིག་ཡོངས་སུ་དག་པ་དང་། སྒྲིབ་པ་མེད་པར་སྒྲ་ཐམས་ཅད་ཐོས་པས་ལྷའི་རྣ་བ་ཡོངས་སུ་དག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་ལྟ་བས་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། སྒྲིབ་པ་མེད་ཅིང་ཆགས་པ་མེད་པར་སྔོན་གྱི་མཐའ་རྗེས་སུ་དྲན་པས་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་འགྲོ་བས་རྫུ་འཕྲུལ་གྱི་བྱ་བ་ཡོངས་སུ་དག་པ་དང་། ཟག་པ་ཐམས་ཅད་ཟད་པ་ཤེས་པས་བསལ་ཅིང་དུས་མ་ཡིན་པ་ཡོངས་སུ་སྤངས་པས་ཟག་པ་ཟད་པ་ཡོངས་སུ་དག་པ་དང་། གཡོ་བ་དང་། རློམ་སེམས་ཐམས་ཅད་དང་བྲལ་བས་དགེ་བའི་རྩ་བ་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་།
en: They are these: one purifies (1) the divine eye by seeing all forms without hindrance; (2) the divine ear by hearing all sounds without hindrance; (3) knowledge of others’ minds by observing the mental activity of all sentient beings; (4) knowledge of past lives by recalling the beginning of the world without hindrance or attachment; (5) miraculous manifestation by traveling to limitless buddhafields; (6) the ability to eliminate all afflictions by knowing how to do so, and by abandoning all that is inopportune; (7) higher perceptions through one’s roots of virtue that give respite from all deception and vanity; and (8) teaching one’s knowledge by instigating in others the experience one has formerly had oneself.

source: ཇི་ལྟར་སྔོན་དམ་བཅས་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པས་ཤེས་པ་བསྟན་པ་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་དེ་ལྟར་རྣམ་པ་བརྒྱད་ཀྱིས་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་གོ །
en: Friends, through these eight modes, one purifies the higher perceptions.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་ཡེ་ཤེས་ཡོངས་སུ་དག་སྟེ།
en: “Friends, one purifies gnosis through eight modes.

source: ཕུང་པོ་ལྔ་ཡོངས་སུ་ཤེས་པས་སྡུག་བསྔལ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། སྲེད་པ་ཤིན་ཏུ་སྤོང་བས་ཀུན་འབྱུང་བ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། བརྟེན་ནས་སྐྱེས་པ་ལ་སྐྱེ་བ་མེད་པར་སོ་སོར་རྟོག་པས་འགོག་པ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་མཉམ་པ་ཉིད་དུ་འཇུག་པས་ལམ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། ལས་དང་བྱ་བ་དང་མི་འགལ་བས་རྒྱུ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གསོ་བ་མེད་པས་རྐྱེན་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་།
en: They are these: one purifies (1) knowledge of suffering by completely knowing the five aggregates; (2) knowledge of the source of suffering by thoroughly ridding oneself of craving; (3) knowledge of the cessation of suffering by analyzing that which is produced dependently as unborn; (4) knowledge of the path to the cessation of suffering by engaging with conditioned and unconditioned phenomena as the same; (5) knowledge of causes through not contradicting the law of karma and action; (6) knowledge of conditions through there being no self, no sentient beings, no life force, and no living beings; (7) knowledge of the three times by completely severing the three spheres; and (8) one perfects omniscient gnosis by engaging all the gnoses that are the perfection of wisdom.

source: འཁོར་གསུམ་ཡོངས་སུ་གཅོད་པས་དུས་གསུམ་ཤེས་པ་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡེ་ཤེས་ཐམས་ཅད་ལ་འཇུག་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་དེ་ལྟར་རྣམ་པ་བརྒྱད་ཀྱིས་ཡེ་ཤེས་ཡོངས་སུ་དག་གོ །
en: Friends, through these eight modes, one purifies gnosis.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་ངེས་པར་སེམས་པ་ཡོངས་སུ་དག་སྟེ།
en: “Friends, one purifies certainty through eight modes.

source: ནང་ཉེ་བར་ཞི་བས་ཡོངས་སུ་དག་པ་དང་། ཕྱི་རོལ་དུ་མི་རྒྱུ་བས་ཡོངས་སུ་དག་པ་དང་། ཁམས་གསུམ་ལ་མི་གནས་པས་ཡོངས་སུ་དག་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་འཐུན་པས་ཡོངས་སུ་དག་པ་དང་། སྐྱེ་བ་མེད་པ་དང་འབྱུང་བ་མེད་པས་ཡོངས་སུ་དག་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པར་སོ་སོར་རྟོག་པས་ཡོངས་སུ་དག་པ་དང་།
en: They are these: one purifies certainty through (1) inner peace, (2) not ruminating about external things, (3) not dwelling on the three realms, (4) behaving in keeping with dependent origination, (5) recognizing the unborn and unarisen, (6) contemplating the absence of formation, (7) contemplating the absence of self in all phenomena, and (8) being thoroughly undisturbed by afflictions.

source: ཆོས་ཐམས་ཅད་བདག་མེད་པར་སོ་སོར་རྟོག་པས་ཡོངས་སུ་དག་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་མི་འཁྲུགས་པས་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་འདི་ནི་རྣམ་པ་བརྒྱད་ཀྱིས་ངེས་པར་སེམས་པ་ཡོངས་སུ་དག་པའོ། །
en: Friends, through these eight modes, one purifies certainty.

source: གྲོགས་པོ་དག་དེ་ལ་རྣམ་པ་བརྒྱད་ཀྱིས་བག་ཡོད་པ་ཡོངས་སུ་དག་སྟེ།
en: “Friends, one purifies heedfulness through eight modes.

source: ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་མེད་པས་ཡོངས་སུ་དག་པ་དང་། ཐོས་པ་ཡོངས་སུ་བྱང་བས་ཡོངས་སུ་དག་པ་དང་། བསམ་གཏན་དེ་ལ་མ་ཆགས་པས་ཡོངས་སུ་དག་པ་དང་། ཤེས་རབ་དང་གསུང་རབ་ཀྱིས་ཡོངས་སུ་དག་པ་དང་། མངོན་པར་ཤེས་པ་ལས་མ་ཉམས་པས་ཡོངས་སུ་དག་པ་དང་། ཡེ་ཤེས་ཀྱིས་རློམ་སེམས་མེད་པས་ཡོངས་སུ་དག་པ་དང་།
en: They are as these: one purifies heedfulness (1) by not clinging to moral discipline as supreme, (2) by cultivating learning, (3) by not being attached to meditative concentration, (4) through wisdom and scriptural knowledge, (5) through flawless higher perceptions, (6) by being without conceptual thinking through gnosis, (7) through being certain beyond dispute, and (8) by not letting virtuous qualities go to waste.

source: ངེས་པར་སེམས་པས་རྩོད་པ་མེད་པས་ཡོངས་སུ་དག་པ་དང་། དགེ་བའི་ཆོས་ཆུད་མི་ཟ་བས་ཡོངས་སུ་དག་པ་སྟེ། གྲོགས་པོ་དག་རྣམ་པ་བརྒྱད་པོ་དེ་དག་གིས་བག་ཡོད་པ་ཡོངས་སུ་དག་གོ །
en: Friends, through these eight modes one purifies heedfulness.

source: གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་ཁྱེད་བག་ཡོད་པར་གྱིས་ཤིག །
en: “Therefore, friends, be heedful.

source: བག་ཡོད་པ་ལ་རྟོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བདེ་བ་གསུམ་ལས་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་རོ། །
en: Bodhisattvas who rely on heedfulness do not fall from the three joys.

source: གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these three?

source: ལྷའི་བདེ་བ་དང་། བསམ་གཏན་གྱི་བདེ་བ་དང་། མྱ་ངན་ལས་འདས་པའི་བདེ་བའོ། །
en: They are the joy of the gods, the joy of meditative absorption, and the joy of nirvāṇa.

source: ངན་སོང་གསུམ་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར་ཏེ།
en: They will be free from the three painful rebirths.

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ཏེ་གསུམ་པོ་དེ་དག་གོ །
en: They are being reborn as hell beings, as animals, and in the world of the Lord of Death.

source: སྡུག་བསྔལ་གསུམ་གྱིས་འཕྲོགས་པར་མི་འགྱུར་ཏེ།
en: They will not be pillaged by the three sufferings.

source: གསུམ་གང་ཞེ་ན། སྐྱེ་བའི་སྡུག་བསྔལ་དང་། རྒ་བའི་སྡུག་བསྔལ་དང་། འཆི་བའི་སྡུག་བསྔལ་ཏེ་གསུམ་པོ་དེ་དག་གོ །
en: What are these three? They are the suffering of birth, the suffering of old age, and the suffering of death.

source: འཇིགས་པ་གསུམ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་ཏེ།
en: They will completely transcend the three fears.

source: གསུམ་གང་ཞེ་ན།
en: What are these three?

source: འཚོ་བ་མེད་པའི་འཇིགས་པ་དང་། ཚིགས་སུ་བཅད་པ་མེད་པའི་འཇིགས་པ་དང་། འཁོར་ལ་བག་ཚ་བའི་འཇིགས་པ་སྟེ་གསུམ་པོ་དེ་དག་གོ །
en: The fear of having no livelihood, the fear of not being praised, and the fear of anxieties in saṃsāra.

source: སྲིད་པ་གསུམ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་ཏེ། འདོད་པའི་སྲིད་པ་དང་། གཟུགས་ཀྱི་སྲིད་པ་དང་། གཟུགས་མེད་པའི་སྲིད་པའོ།
en: They will completely transcend the three realms of existence: existence in the desire realm, the form realm, and the formless realm.

source: དྲི་མ་གསུམ་སྦྱོང་སྟེ། འདོད་ཆགས་ཀྱི་དྲི་མ་དང་། ཞེ་སྡང་གི་དྲི་མ་དང་། གཏི་མུག་གི་དྲི་མའོ། །
en: They clear away the three impurities: the impurities of attachment, hatred, and delusion.

source: བསླབ་པ་གསུམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། ལྷག་པའི་ཚུལ་ཁྲིམས་དང་། ལྷག་པའི་སེམས་དང་། ལྷག་པའི་ཤེས་རབ་བོ། །
en: They accomplish the three trainings: superior moral discipline, superior intention, and superior wisdom.

source: ཡོངས་སུ་དག་པ་གསུམ་ཐོབ་པར་འགྱུར་ཏེ། ལུས་ཡོངས་སུ་དག་པ་དང་། ངག་ཡོངས་སུ་དག་པ་དང་། སེམས་ཡོངས་སུ་དག་པའོ། །
en: They gain three purities: the purity of body, purity of speech, and purity of mind.

source: བསོད་ནམས་བྱ་བ་ལས་བྱུང་བའི་དངོས་པོ་གསུམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། སྦྱིན་པ་ལས་བྱུང་བ་དང་། ཚུལ་ཁྲིམས་ལས་བྱུང་བ་དང་། བསྒོམས་པ་ལས་བྱུང་བའོ། །
en: They perfect the three things that arise from meritorious action: that which comes from giving, that which comes from moral discipline, and that which comes from meditation.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་སྒོམ་པར་བྱེད་དེ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའོ། །
en: They meditate on the three doors of liberation: emptiness, signlessness, and wishlessness.

source: རིགས་གསུམ་རྒྱུན་མི་གཅོད་དེ། སངས་རྒྱས་ཀྱི་རིགས་དང་། ཆོས་ཀྱི་རིགས་དང་། དགེ་འདུན་གྱི་རིགས་སོ། །
en: They do not sever the three lineages: those of the Buddha, of the Dharma, and of the Saṅgha.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་མི་འཐུན་པའི་ཕྱོགས་གསུམ་གསུམ་རབ་ཏུ་སྤོང་སྟེ།
en: “For each perfection, they relinquish three positions that are incompatible with that perfection.

source: སེར་སྣའི་དྲི་མ་དང་། སེར་སྣའི་ཀུན་ཏུ་སྦྱོར་བ་དང་གཏོང་བ་དང་ལྡན་པ་རྣམས་ལ་སྡང་བ་དང་།
en: For giving, these are the stain of avarice, being unable to let go of avarice, and hostility toward those who give.

source: འཆལ་བའི་ཚུལ་ཁྲིམས་དང་། ཚུལ་ཁྲིམས་ལས་ཟློག་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་རྣམས་ལ་སྡང་བ་དང་། གནོད་སེམས་དང་།
en: For moral discipline, they are corrupt moral discipline, turning away from discipline, and hostility toward those who have discipline.

source: བཟོད་པ་ལས་ཟློག་པ་དང་། བཟོད་པ་དང་ལྡན་པ་རྣམས་ལ་སྡང་བ་དང་།
en: For patience, they are harmful intentions, turning away from patience, and hostility toward those who have patience.

source: ལེ་ལོ་དང་། བརྩོན་འགྲུས་ལས་ཟློག་པ་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་རྣམས་ལ་སྡང་བ་དང་། རྣམ་པར་གཡེང་བ་དང་།
en: For effort, they are laziness, turning away from effort, and hostility toward those who make effort.

source: བསམ་གཏན་ལས་ཟློག་པ་དང་། བསམ་གཏན་དང་ལྡན་པ་རྣམས་ལ་སྡང་བ་དང་།
en: For meditative concentration, they are distraction, turning away from meditative concentration, and hostility toward those with meditative concentration.

source: འཆལ་བའི་ཤེས་རབ་དང་། ཤེས་རབ་ལས་ཟློག་པ་དང་། ཤེས་རབ་དང་ལྡན་པ་རྣམས་ལ་སྡང་བའོ། །
en: For wisdom, they are corrupted wisdom, turning away from wisdom, and hostility toward those who have wisdom.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་རྟོན་པ་གསུམ་གསུམ་གྱིས་ཉེ་བར་རྟོན་ཏེ།
en: “Each of the perfections has three bases that support it.

source: གསུམ་གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are the three each?

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་དང་། རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བ་དང་།
en: They are these: The perfection of giving is supported by giving away all of one’s possessions, not harboring hopes about the ripening of one’s actions, and dedicating one’s merit to awakening.

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དང་། ཚུལ་ཁྲིམས་ཡང་དག་པར་ལེན་པ་དང་། ཚུལ་ཁྲིམས་མཆོག་ཏུ་འཛིན་པ་མེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དང་།
en: Moral discipline is supported by genuinely adopting moral discipline, not clinging to moral discipline as supreme, and dedicating one’s merit to awakening.

source: བཟོད་ཅིང་དེས་པ་དང་། བདག་དང་གཞན་རྗེས་སུ་སྲུང་བ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དང་།
en: Patience is supported by acceptance and gentleness, by protecting oneself and others, and dedicating one’s merit to awakening.

source: བརྩོན་འགྲུས་གཅེས་པ་མི་འདོར་བ་དང་། བླང་བ་མེད་ཅིང་དོར་བ་མེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དང་། བསམ་གཏན་ཉེ་བར་ལེན་པ་དང་།
en: Effort is supported by not giving up, neither accepting nor rejecting, and dedicating one’s merit to awakening.

source: མི་གནས་པར་བསམ་གཏན་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དང་།
en: Concentration is supported by taking up meditation, meditating without attachment, and dedicating one’s merit toward awakening.

source: ཤེས་རབ་ཀྱིས་སྣང་བ་དང་། སྤྲོས་པ་མེད་པ་དང་།
en: Wisdom is supported by the light of wisdom, the absence of elaborations, and dedicating one’s merit toward awakening.

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་སྟེ། གྲོགས་པོ་དག་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ཀྱི་རྟོན་པ་འདི་གསུམ་གསུམ་གྱིས་ཉེ་བར་རྟོན་ཏོ། །
en: Friends, bodhisattvas who are heedful support their practice of the perfections with these sets of three for each.

source: གྲོགས་པོ་དག་དེ་ལྟ་བས་ན་ཁྱེད་ཅག་བག་ཡོད་པར་གྱིས་ཤིག །
en: So, friends, be heedful!

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་དང་། དེ་ལས་གཞན་པའི་དགེ་བ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་གང་ཡིན་པ་དག་ཀྱང་བག་ཡོད་པས་འཐོབ་བོ། །
en: For it is through heedfulness that that the awakening of buddha bhagavāns, and the virtues and qualities oriented toward awakening, are achieved.

source: གྲོགས་པོ་དག་བག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚེགས་ཆུང་ངུས་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Friends, heedful bodhisattvas perfect cultivation of the four applications of mindfulness with little trouble.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་བསྒོམ་པ་གང་ཞེ་ན།
en: What is it to meditatively cultivate the four applications of mindfulness?

source: གང་ལ་ལུས་ཀྱི་གནས་མེད་པ་དང་། ཚོར་བའི་གནས་མེད་པ་དང་། སེམས་ཀྱི་གནས་མེད་པ་དང་། ཆོས་ཀྱི་གནས་མེད་པ་དེ།
en: (1) A person’s body has no location; (2) feelings have no location; (3) the mind has no location, and (4) phenomena have no location.

source: ཆོས་ཐམས་ཅད་ཀྱི་གནས་མེད་ཅིང་རྟེན་མེད་པ་འདི་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བསྒོམ་པ་ཞེས་བྱའོ། །
en: The lack of location or basis for all phenomena is called meditation on the four applications of mindfulness.

source: ཚེགས་ཆུང་ངུས་ཡང་དག་པའི་སྤོང་བ་བཞི་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “With little trouble they perfect cultivation of the four correct exertions.

source: ཡང་དག་པའི་སྤོང་བ་བཞི་བསྒོམ་པ་གང་ཞེ་ན།
en: What is it to cultivate the four exertions?

source: གང་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཚུངས་པ་དང་། གཟོད་མ་ཉིད་ནས་མ་སྐྱེས་པ་དང་། མ་བྱུང་བ་དང་། མ་འཐོན་པ་དང་། མངོན་པར་མ་གྲུབ་པར་ཡང་སོ་སོར་རྟོག་ཅིང་སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེ་བར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་ཞིང་སེམས་རབ་ཏུ་འཛིན་ཏེ།
en: (1) Though one analyzes all phenomena as being like space— primordially unborn, unarisen, unemergent, and nonexistent—nevertheless, so as to prevent wrong and unvirtuous states of mind that have not yet arisen from arising in ordinary perception, one maintains an attitude that is fully attentive, with resolve, exertion, and perseverance.

source: ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། ཆོས་ཐམས་ཅད་ལ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མེད་པར་ཡང་སོ་སོར་རྟོག་ཅིང་། སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་ཞིང་སེམས་རབ་ཏུ་འཛིན་ཏེ་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་།
en: “(2) Though one analyzes all phenomena as being without karmic results, nevertheless, so as to avoid all the unvirtuous qualities of other beings and other persons that have not yet appeared in one’s ordinary perception, one maintains an attitude that is fully attentive, with resolve, exertion, and perseverance.
